app/controllers/books_controller.rb

  def index
    @books = Book.order(:position)
---
SELECT "books".* FROM "books" ORDER BY "books"."position" ASC

  def new
    @count = Book.count
---
SELECT COUNT(*) FROM "books"

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "position", "created_at", "updated_at", "author", "price", "published_date") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "TEMP"], ["position", 5], ["created_at", "2024-01-29 22:34:02.953212"], ["updated_at", "2024-01-29 22:34:02.953212"], ["author", nil], ["price", nil], ["published_date", nil]]